Repository: rffontenelle/peps-translation
Catalog: locales/*/LC_MESSAGES/pep-0008.po
Languages: pt_br

source: Imported names should always be considered an implementation detail. Other modules must not rely on indirect access to such imported names unless they are an explicitly documented part of the containing module's API, such as ``os.path`` or a package's ``__init__`` module that exposes functionality from submodules.
pt_br: Os nomes importados devem sempre ser considerados um detalhe de implementação. Outros módulos não devem contar com acesso indireto a tais nomes importados, a menos que sejam uma parte explicitamente documentada da API do módulo recipiente, como ``os.path`` ou um módulo ``__init__`` de um pacote que exponha a funcionalidade dos submódulos.

source: Programming Recommendations
pt_br: Recomendações de programação

source: Code should be written in a way that does not disadvantage other implementations of Python (PyPy, Jython, IronPython, Cython, Psyco, and such).
pt_br: O código deve ser escrito de forma que não prejudique outras implementações do Python (PyPy, Jython, IronPython, Cython, Psyco e outros).

source: For example, do not rely on CPython's efficient implementation of in-place string concatenation for statements in the form ``a += b`` or ``a = a + b``. This optimization is fragile even in CPython (it only works for some types) and isn't present at all in implementations that don't use refcounting. In performance sensitive parts of the library, the ``''.join()`` form should be used instead. This will ensure that concatenation occurs in linear time across various implementations.
pt_br: Por exemplo, não confie na implementação eficiente do CPython de concatenação de strings no local para instruções na forma ``a += b`` ou ``a = a + b``. Essa otimização é frágil mesmo no CPython (funciona apenas para alguns tipos) e não está presente em implementações que não usam refcounting. Em partes sensíveis ao desempenho da biblioteca, o formulário ``''.join()`` deve ser usado. Isso garantirá que a concatenação ocorra em tempo linear em várias implementações.

source: Comparisons to singletons like None should always be done with ``is`` or ``is not``, never the equality operators.
pt_br: Comparações com singletons como None devem sempre ser feitas com ``is`` ou ``is not``, nunca os operadores de igualdade.

source: Also, beware of writing ``if x`` when you really mean ``if x is not None`` -- e.g. when testing whether a variable or argument that defaults to None was set to some other value. The other value might have a type (such as a container) that could be false in a boolean context!
pt_br: Além disso, cuidado ao escrever ``if x`` quando você realmente quer dizer ``if x is not None`` -- por exemplo ao testar se uma variável ou argumento cujo padrão é None foi definido para algum outro valor. O outro valor pode ter um tipo (como um contêiner) que pode ser falso em um contexto booleano!

source: When implementing ordering operations with rich comparisons, it is best to implement all six operations (``__eq__``, ``__ne__``, ``__lt__``, ``__le__``, ``__gt__``, ``__ge__``) rather than relying on other code to only exercise a particular comparison.
pt_br: Ao implementar operações de ordenação com comparações ricas, é melhor implementar todas as seis operações (``__eq__``, ``__ne__``, ``__lt__``, ``__le__``, ``__gt__``, ``__ge__``) em vez de depender de outro código para apenas exercer uma comparação específica.

source: To minimize the effort involved, the ``functools.total_ordering()`` decorator provides a tool to generate missing comparison methods.
pt_br: Para minimizar o esforço envolvido, o decorador ``functools.total_ordering()`` fornece uma ferramenta para gerar métodos de comparação ausentes.

source: :pep:`207` indicates that reflexivity rules *are* assumed by Python. Thus, the interpreter may swap ``y > x`` with ``x < y``, ``y >= x`` with ``x <= y``, and may swap the arguments of ``x == y`` and ``x != y``. The ``sort()`` and ``min()`` operations are guaranteed to use the ``<`` operator and the ``max()`` function uses the ``>`` operator. However, it is best to implement all six operations so that confusion doesn't arise in other contexts.
pt_br: :pep:`207` indica que as regras de reflexividade *são* assumidas pelo Python. Assim, o interpretador pode trocar ``y > x`` por ``x < y``, ``y >= x`` por ``x <= y``, e pode trocar os argumentos de ``x == y`` e ``x != y``. As operações ``sort()`` e ``min()`` são garantidas para usar o operador ``<`` e a função ``max()`` usa o operador ``>``. No entanto, é melhor implementar todas as seis operações para que não surja confusão em outros contextos.

source: The first form means that the name of the resulting function object is specifically 'f' instead of the generic '<lambda>'. This is more useful for tracebacks and string representations in general. The use of the assignment statement eliminates the sole benefit a lambda expression can offer over an explicit def statement (i.e. that it can be embedded inside a larger expression)
pt_br: A primeira forma significa que o nome do objeto de função resultante é especificamente 'f' em vez do genérico '<lambda>'. Isso é mais útil para tracebacks e representações de strings em geral. O uso da instrução de atribuição elimina o único benefício que uma expressão lambda pode oferecer sobre uma instrução def explícita (ou seja, que ela pode ser incorporada dentro de uma expressão maior)

source: Derive exceptions from ``Exception`` rather than ``BaseException``. Direct inheritance from ``BaseException`` is reserved for exceptions where catching them is almost always the wrong thing to do.
pt_br: Derive exceções de ``Exception`` em vez de ``BaseException``. Herança direta de ``BaseException`` é reservada para exceções onde capturá-las é quase sempre a coisa errada a se fazer.

source: Design exception hierarchies based on the distinctions that code *catching* the exceptions is likely to need, rather than the locations where the exceptions are raised. Aim to answer the question "What went wrong?" programmatically, rather than only stating that "A problem occurred" (see :pep:`3151` for an example of this lesson being learned for the builtin exception hierarchy)
pt_br: Projete hierarquias de exceção com base nas distinções que o código *pega* as exceções provavelmente precisará, em vez dos locais onde as exceções são levantadas. Procure responder à pergunta "O que deu errado?" programaticamente, em vez de apenas declarar que "Ocorreu um problema" (consulte :pep:`3151` para obter um exemplo desta lição sendo aprendida para a hierarquia de exceção embutida)

source: Class naming conventions apply here, although you should add the suffix "Error" to your exception classes if the exception is an error. Non-error exceptions that are used for non-local flow control or other forms of signaling need no special suffix.
pt_br: As convenções de nomenclatura de classe se aplicam aqui, embora você deva adicionar o sufixo "Error" às suas classes de exceção se a exceção for um erro. Exceções sem erro que são usadas para controle de fluxo não local ou outras formas de sinalização não precisam de sufixo especial.

source: Use exception chaining appropriately. ``raise X from Y`` should be used to indicate explicit replacement without losing the original traceback.
pt_br: Use o encadeamento de exceções adequadamente. ``raise X from Y`` deve ser usado para indicar substituição explícita sem perder o traceback original.

source: When deliberately replacing an inner exception (using ``raise X from None``), ensure that relevant details are transferred to the new exception (such as preserving the attribute name when converting KeyError to AttributeError, or embedding the text of the original exception in the new exception message).
pt_br: Ao substituir deliberadamente uma exceção interna (usando ``raise X from None``), certifique-se de que os detalhes relevantes sejam transferidos para a nova exceção (como preservar o nome do atributo ao converter KeyError em AttributeError ou incorporar o texto da exceção original em a nova mensagem de exceção).

source: A bare ``except:`` clause will catch SystemExit and KeyboardInterrupt exceptions, making it harder to interrupt a program with Control-C, and can disguise other problems. If you want to catch all exceptions that signal program errors, use ``except Exception:`` (bare except is equivalent to ``except BaseException:``).
pt_br: Uma simples cláusula ``except:`` capturará as exceções SystemExit e KeyboardInterrupt, dificultando a interrupção de um programa com Control-C e pode disfarçar outros problemas. Se você deseja capturar todas as exceções que sinalizam erros de programa, use ``except Exception:`` (bare except é equivalente a ``except BaseException:``).

source: A good rule of thumb is to limit use of bare 'except' clauses to two cases:
pt_br: Uma boa regra é limitar o uso de cláusulas 'except' simples a dois casos:

source: If the exception handler will be printing out or logging the traceback; at least the user will be aware that an error has occurred.
pt_br: Se o manipulador de exceção for exibir ou registrar o traceback; pelo menos o usuário saberá que ocorreu um erro.

source: If the code needs to do some cleanup work, but then lets the exception propagate upwards with ``raise``. ``try...finally`` can be a better way to handle this case.
pt_br: Se o código precisa fazer algum trabalho de limpeza, mas permite que a exceção se propague para cima com ``raise``. ``try...finally`` pode ser uma maneira melhor de lidar com este caso.

source: When catching operating system errors, prefer the explicit exception hierarchy introduced in Python 3.3 over introspection of ``errno`` values.
pt_br: Ao capturar erros do sistema operacional, prefira a hierarquia de exceção explícita introduzida no Python 3.3 em vez da introspecção de valores ``errno``.

source: When a resource is local to a particular section of code, use a ``with`` statement to ensure it is cleaned up promptly and reliably after use. A try/finally statement is also acceptable.
pt_br: Quando um recurso é local para uma determinada seção de código, use uma instrução ``with`` para garantir que ele seja limpo prontamente e de forma confiável após o uso. Uma instrução try/finally também é aceitável.

source: The latter example doesn't provide any information to indicate that the ``__enter__`` and ``__exit__`` methods are doing something other than closing the connection after a transaction. Being explicit is important in this case.
pt_br: O último exemplo não fornece nenhuma informação para indicar que os métodos ``__enter__`` e ``__exit__`` estão fazendo algo diferente de fechar a conexão após uma transação. Ser explícito é importante neste caso.

source: Use ``''.startswith()`` and ``''.endswith()`` instead of string slicing to check for prefixes or suffixes.
pt_br: Use ``''.startswith()`` e ``''.endswith()`` ao invés de fatiar strings para verificar por prefixos ou sufixos.

source: Don't write string literals that rely on significant trailing whitespace. Such trailing whitespace is visually indistinguishable and some editors (or more recently, reindent.py) will trim them.
pt_br: Não escreva strings literais que dependem de espaços em branco significativos à direita. Esses espaços em branco à direita são visualmente indistinguíveis e alguns editores (ou mais recentemente, reindent.py) os aparam.

source: Function Annotations
pt_br: Anotações de funções

source: With the acceptance of :pep:`484`, the style rules for function annotations have changed.
pt_br: Com a aceitação de :pep:`484`, as regras de estilo para anotações de funções mudaram.

source: Function annotations should use :pep:`484` syntax (there are some formatting recommendations for annotations in the previous section).
pt_br: As anotações de função devem usar a sintaxe :pep:`484` (existem algumas recomendações de formatação para anotações na seção anterior).

source: The experimentation with annotation styles that was recommended previously in this PEP is no longer encouraged.
pt_br: A experimentação com estilos de anotação que era recomendada anteriormente nesta PEP não é mais encorajada.

source: However, outside the stdlib, experiments within the rules of :pep:`484` are now encouraged. For example, marking up a large third party library or application with :pep:`484` style type annotations, reviewing how easy it was to add those annotations, and observing whether their presence increases code understandability.
pt_br: No entanto, fora da stdlib, experimentos dentro das regras da :pep:`484` agora são encorajados. Por exemplo, marcar uma grande biblioteca ou aplicação de terceiros com anotações de tipo de estilo :pep:`484`, revisar como foi fácil adicionar essas anotações e observar se sua presença aumenta a compreensão do código.

source: The Python standard library should be conservative in adopting such annotations, but their use is allowed for new code and for big refactorings.
pt_br: A biblioteca padrão do Python deve ser conservadora ao adotar tais anotações, mas seu uso é permitido para novos códigos e para grandes refatorações.

source: near the top of the file; this tells type checkers to ignore all annotations. (More fine-grained ways of disabling complaints from type checkers can be found in :pep:`484`.)
pt_br: próximo ao topo do arquivo; isso diz aos verificadores de tipo para ignorar todas as anotações. (Maneiras mais refinadas de desabilitar reclamações de verificadores de tipo podem ser encontradas na :pep:`484`.)

source: Like linters, type checkers are optional, separate tools. Python interpreters by default should not issue any messages due to type checking and should not alter their behavior based on annotations.
pt_br: Assim como os linters, os verificadores de tipo são ferramentas opcionais e separadas. Os interpretadores Python, por padrão, não devem emitir nenhuma mensagem devido à verificação de tipo e não devem alterar seu comportamento com base em anotações.

source: Users who don't want to use type checkers are free to ignore them. However, it is expected that users of third party library packages may want to run type checkers over those packages. For this purpose :pep:`484` recommends the use of stub files: .pyi files that are read by the type checker in preference of the corresponding .py files. Stub files can be distributed with a library, or separately (with the library author's permission) through the typeshed repo [5]_.
pt_br: Os usuários que não desejam usar verificadores de tipo podem ignorá-los. No entanto, espera-se que os usuários de pacotes de bibliotecas de terceiros possam querer executar verificadores de tipo nesses pacotes. Para este propósito, a :pep:`484` recomenda o uso de arquivos stub: arquivos .pyi que são lidos pelo verificador de tipos em preferência aos arquivos .py correspondentes. Arquivos stub podem ser distribuídos com uma biblioteca ou separadamente (com a permissão do autor da biblioteca) através do repositório typeshed [5]_.

source: Variable Annotations
pt_br: Anotações de variáveis

source: :pep:`526` introduced variable annotations. The style recommendations for them are similar to those on function annotations described above:
pt_br: :pep:`526` introduziu anotações de variáveis. As recomendações de estilo para eles são semelhantes às das anotações de função descritas acima:

source: Annotations for module level variables, class and instance variables, and local variables should have a single space after the colon.
pt_br: Anotações para variáveis de nível de módulo, variáveis de classe e instância e variáveis locais devem ter um único espaço após os dois pontos.

source: There should be no space before the colon.
pt_br: Não deve haver espaço antes dos dois pontos.

source: Although the :pep:`526` is accepted for Python 3.6, the variable annotation syntax is the preferred syntax for stub files on all versions of Python (see :pep:`484` for details).
pt_br: Embora a :pep:`526` seja aceita para Python 3.6, a sintaxe de anotação de variáveis é a sintaxe preferida para arquivos stub em todas as versões do Python (consulte a :pep:`484` para obter detalhes).

source: Footnotes
pt_br: Notas de rodapé

source: *Hanging indentation* is a type-setting style where all the lines in a paragraph are indented except the first line. In the context of Python, the term is used to describe a style where the opening parenthesis of a parenthesized statement is the last non-whitespace character of the line, with subsequent lines being indented until the closing parenthesis.
pt_br: *Recuo suspenso* é um estilo de configuração de tipo em que todas as linhas de um parágrafo são recuadas, exceto a primeira linha. No contexto do Python, o termo é usado para descrever um estilo em que o parêntese de abertura de uma instrução entre parênteses é o último caractere sem espaço em branco da linha, com as linhas subsequentes sendo recuadas até o parêntese de fechamento.

source: References
pt_br: Referências

source: Barry's GNU Mailman style guide http://barry.warsaw.us/software/STYLEGUIDE.txt
pt_br: O guia de estilo do GNU Mailman do Barry http://barry.warsaw.us/software/STYLEGUIDE.txt

source: Donald Knuth's *The TeXBook*, pages 195 and 196.
pt_br: *The TeXBook* do Donald Knuth, páginas 195 e 196.

source: Typeshed repo https://github.com/python/typeshed
pt_br: Repositório do typeshed https://github.com/python/typeshed

source: This document has been placed in the public domain.
pt_br: Este documento foi colocado em domínio público.
