Repository: rffontenelle/peps-translation
Catalog: locales/*/LC_MESSAGES/pep-0008.po
Languages: pt_br

source: Author
pt_br: Autor

source: Active
pt_br: Ativa

source: Type
pt_br: Tipo

source: Process
pt_br: Processo

source: Created
pt_br: Criada em

source: Post-History
pt_br: Pós-história

source: Introduction
pt_br: Introdução

source: This document gives coding conventions for the Python code comprising the standard library in the main Python distribution. Please see the companion informational PEP describing :pep:`style guidelines for the C code in the C implementation of Python <7>`.
pt_br: Este documento fornece convenções de codificação para o código Python que compreende a biblioteca padrão na distribuição principal do Python. Consulte a PEP informativa complementar descrevendo :pep:`diretrizes de estilo para o código C na implementação C do Python <7>`.

source: This document and :pep:`257` (Docstring Conventions) were adapted from Guido's original Python Style Guide essay, with some additions from Barry's style guide [2]_.
pt_br: Este documento e :pep:`257` (Convenções de docstrings) foram adaptados do ensaio original do Guia de Estilo Python do Guido, com algumas adições do guia de estilo de Barry [2]_.

source: This style guide evolves over time as additional conventions are identified and past conventions are rendered obsolete by changes in the language itself.
pt_br: Este guia de estilo evolui ao longo do tempo à medida que convenções adicionais são identificadas e convenções anteriores se tornam obsoletas por mudanças na própria linguagem.

source: Many projects have their own coding style guidelines. In the event of any conflicts, such project-specific guides take precedence for that project.
pt_br: Muitos projetos têm suas próprias diretrizes de estilo de codificação. Em caso de conflito, esses guias específicos do projeto têm precedência para esse projeto.

source: A Foolish Consistency is the Hobgoblin of Little Minds
pt_br: Uma tola consistência é o duende das pequenas mentes

source: One of Guido's key insights is that code is read much more often than it is written. The guidelines provided here are intended to improve the readability of code and make it consistent across the wide spectrum of Python code. As :pep:`20` says, "Readability counts".
pt_br: Um dos principais *insights* de Guido é que o código é lido com muito mais frequência do que escrito. As diretrizes fornecidas aqui destinam-se a melhorar a legibilidade do código e torná-lo consistente em todo o amplo espectro do código Python. Como a :pep:`20` diz, "A legibilidade conta".

source: A style guide is about consistency. Consistency with this style guide is important. Consistency within a project is more important. Consistency within one module or function is the most important.
pt_br: Um guia de estilo é sobre consistência. A consistência com este guia de estilo é importante. A consistência dentro de um projeto é mais importante. A consistência dentro de um módulo ou função é o mais importante.

source: However, know when to be inconsistent -- sometimes style guide recommendations just aren't applicable. When in doubt, use your best judgment. Look at other examples and decide what looks best. And don't hesitate to ask!
pt_br: No entanto, saiba quando ser inconsistente - às vezes, as recomendações do guia de estilo simplesmente não são aplicáveis. Em caso de dúvida, use seu bom senso. Veja outros exemplos e decida o que fica melhor. E não deixe de perguntar!

source: In particular: do not break backwards compatibility just to comply with this PEP!
pt_br: Em particular: não quebre a compatibilidade com versões anteriores apenas para cumprir esta PEP!

source: Some other good reasons to ignore a particular guideline:
pt_br: Algumas outras boas razões para ignorar uma diretriz específica:

source: When applying the guideline would make the code less readable, even for someone who is used to reading code that follows this PEP.
pt_br: Ao aplicar a diretriz tornaria o código menos legível, mesmo para quem está acostumado a ler código que segue este PEP.

source: To be consistent with surrounding code that also breaks it (maybe for historic reasons) -- although this is also an opportunity to clean up someone else's mess (in true XP style).
pt_br: Para ser consistente com o código circundante que também o quebra (talvez por razões históricas) - embora esta também seja uma oportunidade de limpar a bagunça de outra pessoa (no verdadeiro estilo XP).

source: Because the code in question predates the introduction of the guideline and there is no other reason to be modifying that code.
pt_br: Porque o código em questão é anterior à introdução da diretriz e não há outro motivo para modificar esse código.

source: When the code needs to remain compatible with older versions of Python that don't support the feature recommended by the style guide.
pt_br: Quando o código precisa permanecer compatível com versões mais antigas do Python que não suportam o recurso recomendado pelo guia de estilo.

source: Code Lay-out
pt_br: Disposição do código

source: Indentation
pt_br: Recuo (indentação)

source: Use 4 spaces per indentation level.
pt_br: Use 4 espaços por nível de recuo.

source: The 4-space rule is optional for continuation lines.
pt_br: A regra dos 4 espaços é opcional para linhas de continuação.

source: (Also see the discussion of whether to break before or after binary operators below.)
pt_br: (Veja também a discussão sobre a quebra antes ou depois dos operadores binários abaixo.)

source: Tabs or Spaces?
pt_br: Tabs ou espaços?

source: Spaces are the preferred indentation method.
pt_br: Os espaços são o método de recuo preferido.

source: Tabs should be used solely to remain consistent with code that is already indented with tabs.
pt_br: As tabulações devem ser usadas apenas para permanecer consistentes com o código que já está recuado com tabulações.

source: Python disallows mixing tabs and spaces for indentation.
pt_br: O Python não permite a mistura de tabulações e espaços para recuo.

source: Maximum Line Length
pt_br: Comprimento máximo da linha

source: Limit all lines to a maximum of 79 characters.
pt_br: Limite todas as linhas a um máximo de 79 caracteres.

source: For flowing long blocks of text with fewer structural restrictions (docstrings or comments), the line length should be limited to 72 characters.
pt_br: Para longos blocos de texto fluindo com menos restrições estruturais (docstrings ou comentários), o comprimento da linha deve ser limitado a 72 caracteres.

source: Limiting the required editor window width makes it possible to have several files open side by side, and works well when using code review tools that present the two versions in adjacent columns.
pt_br: Limitar a largura necessária da janela do editor possibilita abrir vários arquivos lado a lado e funciona bem ao usar ferramentas de revisão de código que apresentam as duas versões em colunas adjacentes.

source: The default wrapping in most tools disrupts the visual structure of the code, making it more difficult to understand. The limits are chosen to avoid wrapping in editors with the window width set to 80, even if the tool places a marker glyph in the final column when wrapping lines. Some web based tools may not offer dynamic line wrapping at all.
pt_br: O empacotamento padrão na maioria das ferramentas atrapalha a estrutura visual do código, tornando-o mais difícil de entender. Os limites são escolhidos para evitar a quebra em editores com a largura da janela definida como 80, mesmo que a ferramenta coloque um glifo de marcador na coluna final ao quebrar as linhas. Algumas ferramentas baseadas na web podem não oferecer quebra de linha dinâmica.

source: Some teams strongly prefer a longer line length. For code maintained exclusively or primarily by a team that can reach agreement on this issue, it is okay to increase the line length limit up to 99 characters, provided that comments and docstrings are still wrapped at 72 characters.
pt_br: Algumas equipes preferem fortemente um comprimento de linha mais longo. Para o código mantido exclusivamente ou principalmente por uma equipe que pode chegar a um acordo sobre esse problema, não há problema em aumentar o limite de comprimento da linha para até 99 caracteres, desde que os comentários e docstrings ainda tenham 72 caracteres.

source: The Python standard library is conservative and requires limiting lines to 79 characters (and docstrings/comments to 72).
pt_br: A biblioteca padrão do Python é conservadora e requer limitar as linhas a 79 caracteres (e docstrings/comentários a 72).

source: The preferred way of wrapping long lines is by using Python's implied line continuation inside parentheses, brackets and braces. Long lines can be broken over multiple lines by wrapping expressions in parentheses. These should be used in preference to using a backslash for line continuation.
pt_br: A maneira preferida de quebrar linhas longas é usando a continuação de linha implícita do Python entre parênteses, colchetes e chaves. Linhas longas podem ser quebradas em várias linhas envolvendo as expressões entre parênteses. Estes devem ser usados em vez de usar uma barra invertida para continuação de linha.

source: (See the previous discussion on `multiline if-statements`_ for further thoughts on the indentation of such multiline ``with``-statements.)
pt_br: (Veja a discussão anterior sobre `instruções if multilinhas <multiline if-statements>`_ para mais pensamentos sobre o recuo de tais instruções ``with`` multilinhas.)

source: Another such case is with ``assert`` statements.
pt_br: Outro caso é com instruções ``assert``.

source: Make sure to indent the continued line appropriately.
pt_br: Certifique-se de recuar a linha continuada adequadamente.

source: Should a Line Break Before or After a Binary Operator?
pt_br: Uma linha deve quebrar antes ou depois de um operador binário?

source: To solve this readability problem, mathematicians and their publishers follow the opposite convention. Donald Knuth explains the traditional rule in his *Computers and Typesetting* series: "Although formulas within a paragraph always break after binary operations and relations, displayed formulas always break before binary operations" [3]_.
pt_br: Para resolver esse problema de legibilidade, os matemáticos e seus editores seguem a convenção oposta. Donald Knuth explica a regra tradicional em sua série *Computers and Typesetting* (em português, "Computadores e Composição"): "Embora as fórmulas dentro de um parágrafo sempre sejam interrompidas após operações e relações binárias, as fórmulas exibidas sempre são interrompidas antes de operações binárias" [3]_.

source: In Python code, it is permissible to break before or after a binary operator, as long as the convention is consistent locally. For new code Knuth's style is suggested.
pt_br: No código Python, é permitido quebrar antes ou depois de um operador binário, desde que a convenção seja consistente localmente. Para o novo código, o estilo de Knuth é sugerido.

source: Blank Lines
pt_br: Linhas em branco

source: Surround top-level function and class definitions with two blank lines.
pt_br: Envolva funções de nível superior e definições de classe com duas linhas em branco.

source: Method definitions inside a class are surrounded by a single blank line.
pt_br: As definições de método dentro de uma classe são cercadas por uma única linha em branco.

source: Extra blank lines may be used (sparingly) to separate groups of related functions. Blank lines may be omitted between a bunch of related one-liners (e.g. a set of dummy implementations).
pt_br: Linhas em branco extras podem ser usadas (com moderação) para separar grupos de funções relacionadas. Linhas em branco podem ser omitidas entre vários códigos de uma linha relacionados (por exemplo, um conjunto de implementações fictícias).

source: Use blank lines in functions, sparingly, to indicate logical sections.
pt_br: Use linhas em branco em funções, com moderação, para indicar seções lógicas.

source: Python accepts the control-L (i.e. ^L) form feed character as whitespace; many tools treat these characters as page separators, so you may use them to separate pages of related sections of your file. Note, some editors and web-based code viewers may not recognize control-L as a form feed and will show another glyph in its place.
pt_br: O Python aceita o caractere de feed de formulário control-L (ou seja, ^L) como espaço em branco; muitas ferramentas tratam esses caracteres como separadores de página, então você pode usá-los para separar páginas de seções relacionadas de seu arquivo. Observe que alguns editores e visualizadores de código baseados na Web podem não reconhecer control-L como um feed de formulário e mostrarão outro glifo em seu lugar.

source: Source File Encoding
pt_br: Codificação do arquivo-fonte

source: Code in the core Python distribution should always use UTF-8, and should not have an encoding declaration.
pt_br: O código na distribuição principal do Python sempre deve usar UTF-8 e não deve ter uma declaração de codificação.

source: In the standard library, non-UTF-8 encodings should be used only for test purposes. Use non-ASCII characters sparingly, preferably only to denote places and human names. If using non-ASCII characters as data, avoid noisy Unicode characters like z̯̯͡a̧͎̺l̡͓̫g̹̲o̡̼̘ and byte order marks.
pt_br: Na biblioteca padrão, as codificações não UTF-8 devem ser usadas apenas para fins de teste. Use caracteres não ASCII com moderação, de preferência apenas para denotar lugares e nomes humanos. Se estiver usando caracteres não ASCII como dados, evite caracteres Unicode ruidosos como z̯̯͡a̧͎̺l̡͓̫g̹̲o̡̼̘ e marcas de ordem de byte.

source: All identifiers in the Python standard library MUST use ASCII-only identifiers, and SHOULD use English words wherever feasible (in many cases, abbreviations and technical terms are used which aren't English).
pt_br: Todos os identificadores na biblioteca padrão do Python DEVEM usar identificadores somente ASCII e DEVEM usar palavras em inglês sempre que possível (em muitos casos, são usadas abreviações e termos técnicos que não são em inglês).

source: Open source projects with a global audience are encouraged to adopt a similar policy.
pt_br: Projetos de código aberto com público global são incentivados a adotar uma política semelhante.

source: Imports
pt_br: Importações

source: Imports are always put at the top of the file, just after any module comments and docstrings, and before module globals and constants.
pt_br: As importações são sempre colocadas no início do arquivo, logo após quaisquer comentários e docstrings do módulo e antes das constantes e globais do módulo.

source: Imports should be grouped in the following order:
pt_br: As importações devem ser agrupadas na seguinte ordem:

source: Standard library imports.
pt_br: Importações de biblioteca padrão.

source: Related third party imports.
pt_br: Importações de terceiros relacionadas.

source: Local application/library specific imports.
pt_br: Importações específicas de aplicativo/biblioteca local.

source: You should put a blank line between each group of imports.
pt_br: Você deve colocar uma linha em branco entre cada grupo de importações.

source: Standard library code should avoid complex package layouts and always use absolute imports.
pt_br: O código de biblioteca padrão deve evitar layouts de pacote complexos e sempre usar importações absolutas.

source: Wildcard imports (``from <module> import *``) should be avoided, as they make it unclear which names are present in the namespace, confusing both readers and many automated tools. There is one defensible use case for a wildcard import, which is to republish an internal interface as part of a public API (for example, overwriting a pure Python implementation of an interface with the definitions from an optional accelerator module and exactly which definitions will be overwritten isn't known in advance).
pt_br: Importações curinga (``from <módulo> import *``) devem ser evitadas, pois não deixam claro quais nomes estão presentes no espaço de nomes, confundindo os leitores e muitas ferramentas automatizadas. Há um caso de uso defensável para uma importação curinga, que é republicar uma interface interna como parte de uma API pública (por exemplo, sobrescrever uma implementação Python pura de uma interface com as definições de um módulo acelerador opcional e exatamente quais definições serão substituído não é conhecido antecipadamente).

source: When republishing names this way, the guidelines below regarding public and internal interfaces still apply.
pt_br: Ao republicar nomes dessa maneira, as diretrizes abaixo sobre interfaces públicas e internas ainda se aplicam.

source: Module Level Dunder Names
pt_br: Nomes dunder de nível de módulo

source: String Quotes
pt_br: Apas de strings

source: In Python, single-quoted strings and double-quoted strings are the same. This PEP does not make a recommendation for this. Pick a rule and stick to it. When a string contains single or double quote characters, however, use the other one to avoid backslashes in the string. It improves readability.
pt_br: Em Python, strings com aspas simples e strings com aspas duplas são iguais. Este PEP não faz uma recomendação para isso. Escolha uma regra e cumpra-a. No entanto, quando uma string contém aspas simples ou duplas, use a outra para evitar barras invertidas na string. Melhora a legibilidade.

source: For triple-quoted strings, always use double quote characters to be consistent with the docstring convention in :pep:`257`.
pt_br: Para strings com aspas triplas, sempre use caracteres de aspas duplas para ser consistente com a convenção de docstrings em :pep:`257`.

source: Whitespace in Expressions and Statements
pt_br: Espaço em branco em expressões e instruções

source: Pet Peeves
pt_br: Particularmente incômodo

source: Avoid extraneous whitespace in the following situations:
pt_br: Evite espaços em branco estranhos nas seguintes situações:

source: Other Recommendations
pt_br: Outras recomendações

source: Avoid trailing whitespace anywhere. Because it's usually invisible, it can be confusing: e.g. a backslash followed by a space and a newline does not count as a line continuation marker. Some editors don't preserve it and many projects (like CPython itself) have pre-commit hooks that reject it.
pt_br: Evite espaços em branco à direita em qualquer lugar. Por ser geralmente invisível, pode ser confuso: por ex. uma barra invertida seguida por um espaço e uma nova linha não contam como um marcador de continuação de linha. Alguns editores não o preservam e muitos projetos (como o próprio CPython) têm ganchos de pré-commit que o rejeitam.

source: Always surround these binary operators with a single space on either side: assignment (``=``), augmented assignment (``+=``, ``-=`` etc.), comparisons (``==``, ``<``, ``>``, ``!=``, ``<>``, ``<=``, ``>=``, ``in``, ``not in``, ``is``, ``is not``), Booleans (``and``, ``or``, ``not``).
pt_br: Sempre coloque esses operadores binários com um único espaço em cada lado: atribuição (``=``), atribuição aumentada (``+=``, ``-=`` etc.), comparações (``==`` , ``<``, ``>``, ``!=``, ``<>``, ``<=``, ``>=``, ``in``, ``not in``, ``is``, ``is not``), booleanos (``and``, ``or``, ``not``).

source: While sometimes it's okay to put an if/for/while with a small body on the same line, never do this for multi-clause statements. Also avoid folding such long lines!
pt_br: Embora às vezes não haja problema em colocar um if/for/while com um corpo pequeno na mesma linha, nunca faça isso para declarações com várias cláusulas. Evite também dobrar linhas tão longas!

source: When to Use Trailing Commas
pt_br: Quando usar vírgulas à direita

source: Comments
pt_br: Comentários

source: Comments that contradict the code are worse than no comments. Always make a priority of keeping the comments up-to-date when the code changes!
pt_br: Comentários que contradizem o código são piores do que nenhum comentário. Sempre tenha como prioridade manter os comentários atualizados quando o código mudar!

source: Comments should be complete sentences. The first word should be capitalized, unless it is an identifier that begins with a lower case letter (never alter the case of identifiers!).
pt_br: Os comentários devem ser frases completas. A primeira palavra deve ser maiúscula, a menos que seja um identificador que comece com uma letra minúscula (nunca altere a caixa dos identificadores!).

source: Block comments generally consist of one or more paragraphs built out of complete sentences, with each sentence ending in a period.
pt_br: Os comentários em bloco geralmente consistem em um ou mais parágrafos construídos a partir de frases completas, com cada frase terminando em um ponto.

source: Ensure that your comments are clear and easily understandable to other speakers of the language you are writing in.
pt_br: Certifique-se de que seus comentários sejam claros e facilmente compreensíveis para outros falantes do idioma em que você está escrevendo.

source: Python coders from non-English speaking countries: please write your comments in English, unless you are 120% sure that the code will never be read by people who don't speak your language.
pt_br: Programadores em Python de países que não falam inglês: por favor, escreva seus comentários em inglês, a menos que você tenha certeza de 120% sem dúvida alguma de que o código nunca será lido por pessoas que não falam seu idioma.

source: Block Comments
pt_br: Comentários de bloco

source: Block comments generally apply to some (or all) code that follows them, and are indented to the same level as that code. Each line of a block comment starts with a ``#`` and a single space (unless it is indented text inside the comment).
pt_br: Os comentários em bloco geralmente se aplicam a algum (ou a todos) o código que os segue e são recuados no mesmo nível desse código. Cada linha de um comentário de bloco começa com um ``#`` e um único espaço (a menos que seja um texto recuado dentro do comentário).

source: Paragraphs inside a block comment are separated by a line containing a single ``#``.
pt_br: Os parágrafos dentro de um comentário em bloco são separados por uma linha contendo um único ``#``.

source: Inline Comments
pt_br: Comentários em linha

source: Use inline comments sparingly.
pt_br: Use comentários em linha (*inline* ou embutidos) com moderação.

source: An inline comment is a comment on the same line as a statement. Inline comments should be separated by at least two spaces from the statement. They should start with a # and a single space.
pt_br: Um comentário em linha é um comentário na mesma linha que uma instrução. Os comentários em linha devem ser separados por pelo menos dois espaços da instrução. Eles devem começar com um # e um único espaço.

source: Documentation Strings
pt_br: Strings de documentação

source: Conventions for writing good documentation strings (a.k.a. "docstrings") are immortalized in :pep:`257`.
pt_br: As convenções para escrever boas strings de documentação (também conhecidas como "docstrings") são imortalizadas na :pep:`257`.

source: Write docstrings for all public modules, functions, classes, and methods. Docstrings are not necessary for non-public methods, but you should have a comment that describes what the method does. This comment should appear after the ``def`` line.
pt_br: Escreva docstrings para todos os módulos, funções, classes e métodos públicos. Docstrings não são necessárias para métodos não públicos, mas você deve ter um comentário que descreva o que o método faz. Este comentário deve aparecer após a linha ``def``.

source: Naming Conventions
pt_br: Convenções de nomenclatura
