Repository: rffontenelle/peps-translation
Catalog: locales/*/LC_MESSAGES/pep-0008.po
Languages: pt_br

source: The naming conventions of Python's library are a bit of a mess, so we'll never get this completely consistent -- nevertheless, here are the currently recommended naming standards. New modules and packages (including third party frameworks) should be written to these standards, but where an existing library has a different style, internal consistency is preferred.
pt_br: As convenções de nomenclatura da biblioteca do Python são um pouco confusas, então nunca conseguiremos isso completamente consistente -- no entanto, aqui estão os padrões de nomenclatura atualmente recomendados. Novos módulos e pacotes (incluindo estruturas de terceiros) devem ser escritos de acordo com esses padrões, mas onde uma biblioteca existente tiver um estilo diferente, a consistência interna é preferida.

source: Overriding Principle
pt_br: Princípio primordial

source: Names that are visible to the user as public parts of the API should follow conventions that reflect usage rather than implementation.
pt_br: Os nomes que são visíveis para o usuário como partes públicas da API devem seguir convenções que reflitam o uso em vez da implementação.

source: Descriptive: Naming Styles
pt_br: Descritivo: estilos de nomenclatura

source: There are a lot of different naming styles. It helps to be able to recognize what naming style is being used, independently from what they are used for.
pt_br: Existem muitos estilos de nomenclatura diferentes. Ajuda a reconhecer qual estilo de nomenclatura está sendo usado, independentemente de para que são usados.

source: The following naming styles are commonly distinguished:
pt_br: Os seguintes estilos de nomenclatura são comumente distinguidos:

source: ``b`` (single lowercase letter)
pt_br: ``b`` (única letra minúscula)

source: ``B`` (single uppercase letter)
pt_br: ``B`` (única letra maiúscula)

source: ``lowercase``
pt_br: ``minúsculo``

source: ``lower_case_with_underscores``
pt_br: ``letras_maiúsculas_com_sublinhados``

source: ``UPPERCASE``
pt_br: ``CAIXAALTA``

source: ``UPPER_CASE_WITH_UNDERSCORES``
pt_br: ``CAIXA_ALTA_COM_SUBLINHADOS``

source: ``CapitalizedWords`` (or CapWords, or CamelCase -- so named because of the bumpy look of its letters [4]_). This is also sometimes known as StudlyCaps.
pt_br: ``PalavrasComMaiúsculos`` (ou CapWords ou CamelCase -- assim chamado por causa da aparência irregular de suas letras [4]_). Isso também é conhecido como StudlyCaps.

source: Note: When using acronyms in CapWords, capitalize all the letters of the acronym. Thus HTTPServerError is better than HttpServerError.
pt_br: Nota: Ao usar acrônimos em CapWords, coloque todas as letras do acrônimo em maiúsculas. Assim, HTTPServerError é melhor que HttpServerError.

source: ``mixedCase`` (differs from CapitalizedWords by initial lowercase character!)
pt_br: ``misturaMaiúsculo`` (difere de PalavrasComMaiúsculos pelo caractere inicial minúsculo!)

source: ``Capitalized_Words_With_Underscores`` (ugly!)
pt_br: ``Palavras_Maiúsculas_Com_Sublinhado`` (feio!)

source: There's also the style of using a short unique prefix to group related names together. This is not used much in Python, but it is mentioned for completeness. For example, the ``os.stat()`` function returns a tuple whose items traditionally have names like ``st_mode``, ``st_size``, ``st_mtime`` and so on. (This is done to emphasize the correspondence with the fields of the POSIX system call struct, which helps programmers familiar with that.)
pt_br: Há também o estilo de usar um prefixo exclusivo curto para agrupar nomes relacionados. Isso não é muito usado em Python, mas é mencionado para fins de integridade. Por exemplo, a função ``os.stat()`` retorna uma tupla cujos itens tradicionalmente têm nomes como ``st_mode``, ``st_size``, ``st_mtime`` e assim por diante. (Isso é feito para enfatizar a correspondência com os campos da estrutura de chamada do sistema POSIX, que ajuda os programadores familiarizados com isso.)

source: The X11 library uses a leading X for all its public functions. In Python, this style is generally deemed unnecessary because attribute and method names are prefixed with an object, and function names are prefixed with a module name.
pt_br: A biblioteca X11 usa um X inicial para todas as suas funções públicas. Em Python, esse estilo geralmente é considerado desnecessário porque os nomes de atributos e métodos são prefixados com um objeto e os nomes das funções são prefixados com um nome de módulo.

source: In addition, the following special forms using leading or trailing underscores are recognized (these can generally be combined with any case convention):
pt_br: Além disso, as seguintes formas especiais usando sublinhados à esquerda ou à direita são reconhecidas (geralmente podem ser combinadas com qualquer convenção de maiúsculas e minúsculas):

source: ``_single_leading_underscore``: weak "internal use" indicator. E.g. ``from M import *`` does not import objects whose names start with an underscore.
pt_br: ``_sublinhado_inicial_único``: fraco indicador de "uso interno". Por exemplo. ``from M import *`` não importa objetos cujos nomes começam com um sublinhado.

source: ``__double_leading_underscore``: when naming a class attribute, invokes name mangling (inside class FooBar, ``__boo`` becomes ``_FooBar__boo``; see below).
pt_br: ``__sublinhados_inicial_duplo``: ao nomear um atributo de classe, invoca alteração de nome (dentro da classe FooBar, ``__boo`` torna-se ``_FooBar__boo``; veja abaixo).

source: ``__double_leading_and_trailing_underscore__``: "magic" objects or attributes that live in user-controlled namespaces. E.g. ``__init__``, ``__import__`` or ``__file__``. Never invent such names; only use them as documented.
pt_br: ``__sublinhados_inicial_e_final_duplo__``: objetos ou atributos "mágicos" que vivem em espaços de nomes controlados pelo usuário. Por exemplo. ``__init__``, ``__import__`` ou ``__file__``. Nunca invente tais nomes; use-os apenas conforme documentado.

source: Prescriptive: Naming Conventions
pt_br: Prescritivo: convenções de nomenclatura

source: Names to Avoid
pt_br: Nomes para evitar

source: Never use the characters 'l' (lowercase letter el), 'O' (uppercase letter oh), or 'I' (uppercase letter eye) as single character variable names.
pt_br: Nunca use os caracteres 'l' (letra minúscula ele), 'O' (letra maiúscula oh) ou 'I' (letra maiúscula i) como nomes de variáveis de um único caractere.

source: In some fonts, these characters are indistinguishable from the numerals one and zero. When tempted to use 'l', use 'L' instead.
pt_br: Em algumas fontes, esses caracteres são indistinguíveis dos numerais um e zero. Quando tentado a usar 'l', use 'L'.

source: ASCII Compatibility
pt_br: Compatibilidade com ASCII

source: Identifiers used in the standard library must be ASCII compatible as described in the :pep:`policy section <3131#policy-specification>` of :pep:`3131`.
pt_br: Os identificadores usados na biblioteca padrão devem ser compatíveis com ASCII conforme descrito na :pep:`seção de políticas <3131#policy-specification>` da :pep:`3131`.

source: Package and Module Names
pt_br: Nomes de pacotes e módulos

source: Modules should have short, all-lowercase names. Underscores can be used in the module name if it improves readability. Python packages should also have short, all-lowercase names, although the use of underscores is discouraged.
pt_br: Os módulos devem ter nomes curtos, todos em minúsculas. Sublinhados podem ser usados no nome do módulo se melhorarem a legibilidade. Os pacotes Python também devem ter nomes curtos, todos em minúsculas, embora o uso de sublinhados seja desencorajado.

source: When an extension module written in C or C++ has an accompanying Python module that provides a higher level (e.g. more object oriented) interface, the C/C++ module has a leading underscore (e.g. ``_socket``).
pt_br: Quando um módulo de extensão escrito em C ou C++ possui um módulo Python que fornece uma interface de nível superior (por exemplo, mais orientada a objetos), o módulo C/C++ possui um sublinhado inicial (por exemplo, ``_socket``).

source: Class Names
pt_br: Nomes de classe

source: Class names should normally use the CapWords convention.
pt_br: Nomes de classe normalmente devem usar a convenção CapWords (PalavrasMaiúsculas).

source: The naming convention for functions may be used instead in cases where the interface is documented and used primarily as a callable.
pt_br: A convenção de nomenclatura para funções pode ser usada nos casos em que a interface é documentada e usada principalmente como um chamável.

source: Note that there is a separate convention for builtin names: most builtin names are single words (or two words run together), with the CapWords convention used only for exception names and builtin constants.
pt_br: Observe que há uma convenção separada para nomes embutidos: a maioria dos nomes embutidos são palavras únicas (ou duas palavras juntas), com a convenção CapWords usada apenas para nomes de exceção e constantes embutidas.

source: Type Variable Names
pt_br: Nomes de variáveis de tipo

source: Exception Names
pt_br: Nomes de exceção

source: Because exceptions should be classes, the class naming convention applies here. However, you should use the suffix "Error" on your exception names (if the exception actually is an error).
pt_br: Como as exceções devem ser classes, a convenção de nomenclatura de classe se aplica aqui. No entanto, você deve usar o sufixo "Error" em seus nomes de exceção (se a exceção for realmente um erro).

source: Global Variable Names
pt_br: Nomes de variáveis globais

source: (Let's hope that these variables are meant for use inside one module only.) The conventions are about the same as those for functions.
pt_br: (Espero que essas variáveis sejam usadas apenas dentro de um módulo.) As convenções são quase as mesmas das funções.

source: Modules that are designed for use via ``from M import *`` should use the ``__all__`` mechanism to prevent exporting globals, or use the older convention of prefixing such globals with an underscore (which you might want to do to indicate these globals are "module non-public").
pt_br: Os módulos que são projetados para uso via ``from M import *`` devem usar o mecanismo ``__all__`` para evitar a exportação de globais, ou usar a convenção mais antiga de prefixar tais globais com um sublinhado (o que você pode querer fazer para indicar esses globais são "módulo não público").

source: Function and Variable Names
pt_br: Nomes de funções e variáveis

source: Function names should be lowercase, with words separated by underscores as necessary to improve readability.
pt_br: Os nomes das funções devem estar em letras minúsculas, com palavras separadas por sublinhados conforme necessário para melhorar a legibilidade.

source: Variable names follow the same convention as function names.
pt_br: Os nomes das variáveis seguem a mesma convenção dos nomes das funções.

source: mixedCase is allowed only in contexts where that's already the prevailing style (e.g. threading.py), to retain backwards compatibility.
pt_br: misturaMaiúsculo é permitido apenas em contextos onde esse já é o estilo predominante (por exemplo, threading.py), para manter a compatibilidade com versões anteriores.

source: Function and Method Arguments
pt_br: Argumentos de função e método

source: Always use ``self`` for the first argument to instance methods.
pt_br: Sempre use ``self`` para o primeiro argumento para métodos de instância.

source: Always use ``cls`` for the first argument to class methods.
pt_br: Sempre use ``cls`` para o primeiro argumento para métodos de classe.

source: If a function argument's name clashes with a reserved keyword, it is generally better to append a single trailing underscore rather than use an abbreviation or spelling corruption. Thus ``class_`` is better than ``clss``. (Perhaps better is to avoid such clashes by using a synonym.)
pt_br: Se o nome de um argumento de função entrar em conflito com uma palavra reservada, geralmente é melhor acrescentar um único sublinhado à direita em vez de usar uma abreviação ou corrupção da ortografia. Portanto ``class_`` é melhor que ``clss``. (Talvez seja melhor evitar tais conflitos usando um sinônimo.)

source: Method Names and Instance Variables
pt_br: Nomes de métodos e variáveis de instância

source: Use the function naming rules: lowercase with words separated by underscores as necessary to improve readability.
pt_br: Use as regras de nomenclatura de funções: letras minúsculas com palavras separadas por sublinhados conforme necessário para melhorar a legibilidade.

source: Use one leading underscore only for non-public methods and instance variables.
pt_br: Use um sublinhado inicial apenas para métodos não públicos e variáveis de instância.

source: To avoid name clashes with subclasses, use two leading underscores to invoke Python's name mangling rules.
pt_br: Para evitar conflitos de nomes com subclasses, use dois sublinhados iniciais para invocar as regras de alteração de nomes do Python.

source: Python mangles these names with the class name: if class Foo has an attribute named ``__a``, it cannot be accessed by ``Foo.__a``. (An insistent user could still gain access by calling ``Foo._Foo__a``.) Generally, double leading underscores should be used only to avoid name conflicts with attributes in classes designed to be subclassed.
pt_br: Python confunde esses nomes com o nome da classe: se a classe Foo tiver um atributo chamado ``__a``, ele não pode ser acessado por ``Foo.__a``. (Um usuário insistente ainda pode obter acesso chamando ``Foo._Foo__a``.) Geralmente, sublinhados iniciais duplos devem ser usados apenas para evitar conflitos de nome com atributos em classes projetadas para serem subclasses.

source: Note: there is some controversy about the use of __names (see below).
pt_br: Nota: existe alguma controvérsia sobre o uso de __names (veja abaixo).

source: Constants
pt_br: Constantes

source: Constants are usually defined on a module level and written in all capital letters with underscores separating words. Examples include ``MAX_OVERFLOW`` and ``TOTAL``.
pt_br: As constantes geralmente são definidas em um nível de módulo e escritas em letras maiúsculas com sublinhados separando as palavras. Exemplos incluem ``MAX_OVERFLOW`` e ``TOTAL``.

source: Designing for Inheritance
pt_br: Projetando para herança

source: Always decide whether a class's methods and instance variables (collectively: "attributes") should be public or non-public. If in doubt, choose non-public; it's easier to make it public later than to make a public attribute non-public.
pt_br: Sempre decida se os métodos de uma classe e as variáveis de instância (coletivamente: "atributos") devem ser públicos ou não públicos. Em caso de dúvida, escolha não público; é mais fácil torná-lo público posteriormente do que tornar um atributo público não público.

source: Public attributes are those that you expect unrelated clients of your class to use, with your commitment to avoid backwards incompatible changes. Non-public attributes are those that are not intended to be used by third parties; you make no guarantees that non-public attributes won't change or even be removed.
pt_br: Atributos públicos são aqueles que você espera que clientes não relacionados de sua classe usem, com seu compromisso de evitar alterações incompatíveis com versões anteriores. Atributos não públicos são aqueles que não se destinam a ser usados por terceiros; você não garante que os atributos não públicos não serão alterados ou mesmo removidos.

source: We don't use the term "private" here, since no attribute is really private in Python (without a generally unnecessary amount of work).
pt_br: Não usamos o termo "privado" aqui, pois nenhum atributo é realmente privado em Python (sem uma quantidade de trabalho geralmente desnecessária).

source: Another category of attributes are those that are part of the "subclass API" (often called "protected" in other languages). Some classes are designed to be inherited from, either to extend or modify aspects of the class's behavior. When designing such a class, take care to make explicit decisions about which attributes are public, which are part of the subclass API, and which are truly only to be used by your base class.
pt_br: Outra categoria de atributos são aqueles que fazem parte da "API de subclasse" (muitas vezes chamada de "protegida" em outras linguagens). Algumas classes são projetadas para serem herdadas, seja para estender ou modificar aspectos do comportamento da classe. Ao projetar essa classe, tome cuidado para tomar decisões explícitas sobre quais atributos são públicos, quais fazem parte da API da subclasse e quais devem ser realmente usados apenas por sua classe base.

source: With this in mind, here are the Pythonic guidelines:
pt_br: Com isso em mente, aqui estão as diretrizes pythônica:

source: Public attributes should have no leading underscores.
pt_br: Os atributos públicos não devem ter sublinhados à esquerda.

source: If your public attribute name collides with a reserved keyword, append a single trailing underscore to your attribute name. This is preferable to an abbreviation or corrupted spelling. (However, notwithstanding this rule, 'cls' is the preferred spelling for any variable or argument which is known to be a class, especially the first argument to a class method.)
pt_br: Se o nome do atributo público colidir com uma palavra-chave reservada, anexe um único sublinhado à direita ao nome do atributo. Isso é preferível a uma abreviação ou ortografia corrompida. (No entanto, não obstante esta regra, 'cls' é a ortografia preferida para qualquer variável ou argumento que seja conhecido como uma classe, especialmente o primeiro argumento para um método de classe.)

source: Note 1: See the argument name recommendation above for class methods.
pt_br: Observação 1: consulte a recomendação de nome de argumento acima para métodos de classe.

source: For simple public data attributes, it is best to expose just the attribute name, without complicated accessor/mutator methods. Keep in mind that Python provides an easy path to future enhancement, should you find that a simple data attribute needs to grow functional behavior. In that case, use properties to hide functional implementation behind simple data attribute access syntax.
pt_br: Para atributos de dados públicos simples, é melhor expor apenas o nome do atributo, sem métodos complicados de acessador/mutador. Lembre-se de que o Python fornece um caminho fácil para melhorias futuras, caso você descubra que um atributo de dados simples precisa aumentar o comportamento funcional. Nesse caso, use propriedades para ocultar a implementação funcional por trás da sintaxe simples de acesso ao atributo de dados.

source: Note 1: Try to keep the functional behavior side-effect free, although side-effects such as caching are generally fine.
pt_br: Observação 1: tente manter o efeito colateral do comportamento funcional livre, embora efeitos colaterais como o armazenamento em cache sejam geralmente bons.

source: Note 2: Avoid using properties for computationally expensive operations; the attribute notation makes the caller believe that access is (relatively) cheap.
pt_br: Nota 2: Evite usar propriedades para operações computacionalmente caras; a notação de atributo faz o chamador acreditar que o acesso é (relativamente) barato.

source: If your class is intended to be subclassed, and you have attributes that you do not want subclasses to use, consider naming them with double leading underscores and no trailing underscores. This invokes Python's name mangling algorithm, where the name of the class is mangled into the attribute name. This helps avoid attribute name collisions should subclasses inadvertently contain attributes with the same name.
pt_br: Se sua classe for destinada a ter subclasses e você tiver atributos que não deseja que as subclasses usem, considere nomeá-los com sublinhados duplos à esquerda e sem sublinhados à direita. Isso invoca o algoritmo de confusão de nomes do Python, onde o nome da classe é confundido com o nome do atributo. Isso ajuda a evitar colisões de nomes de atributos caso as subclasses contenham inadvertidamente atributos com o mesmo nome.

source: Note 1: Note that only the simple class name is used in the mangled name, so if a subclass chooses both the same class name and attribute name, you can still get name collisions.
pt_br: Observação 1: observe que apenas o nome de classe simples é usado no nome desconfigurado, portanto, se uma subclasse escolher o mesmo nome de classe e o mesmo nome de atributo, você ainda poderá obter colisões de nomes.

source: Note 2: Name mangling can make certain uses, such as debugging and ``__getattr__()``, less convenient. However the name mangling algorithm is well documented and easy to perform manually.
pt_br: Nota 2: A confusão de nomes pode tornar certos usos, como depuração e ``__getattr__()``, menos convenientes. No entanto, o algoritmo de alteração de nomes é bem documentado e fácil de executar manualmente.

source: Note 3: Not everyone likes name mangling. Try to balance the need to avoid accidental name clashes with potential use by advanced callers.
pt_br: Nota 3: Nem todo mundo gosta de confusão de nomes. Tente equilibrar a necessidade de evitar conflitos acidentais de nomes com o uso potencial por chamadores avançados.

source: Public and Internal Interfaces
pt_br: Interfaces públicas e internas

source: Any backwards compatibility guarantees apply only to public interfaces. Accordingly, it is important that users be able to clearly distinguish between public and internal interfaces.
pt_br: Quaisquer garantias de compatibilidade com versões anteriores aplicam-se apenas a interfaces públicas. Assim, é importante que os usuários possam distinguir claramente entre interfaces públicas e internas.

source: Documented interfaces are considered public, unless the documentation explicitly declares them to be provisional or internal interfaces exempt from the usual backwards compatibility guarantees. All undocumented interfaces should be assumed to be internal.
pt_br: As interfaces documentadas são consideradas públicas, a menos que a documentação as declare explicitamente como interfaces provisórias ou internas isentas das garantias usuais de compatibilidade com versões anteriores. Todas as interfaces não documentadas devem ser consideradas internas.

source: To better support introspection, modules should explicitly declare the names in their public API using the ``__all__`` attribute. Setting ``__all__`` to an empty list indicates that the module has no public API.
pt_br: Para ter melhor suporte a introspecção, os módulos devem declarar explicitamente os nomes em sua API pública usando o atributo ``__all__``. Definir ``__all__`` como uma lista vazia indica que o módulo não possui API pública.

source: Even with ``__all__`` set appropriately, internal interfaces (packages, modules, classes, functions, attributes or other names) should still be prefixed with a single leading underscore.
pt_br: Mesmo com ``__all__`` definido apropriadamente, as interfaces internas (pacotes, módulos, classes, funções, atributos ou outros nomes) ainda devem ser prefixadas com um único sublinhado à esquerda.

source: An interface is also considered internal if any containing namespace (package, module or class) is considered internal.
pt_br: Uma interface também é considerada interna se qualquer espaço de nomes (pacote, módulo ou classe) for considerado interno.
